demanda/app/controllers/criancas_controller.rb

SELECT * FROM `criancas` WHERE (matricula = 1 and id not in (select crianca_id from matriculas))
---
  def crianca_anterior
    @crianca_anterior = Crianca.find(:all, :conditions => ["matricula = 1 and id not in (select crianca_id from matriculas)"], :include => ['matriculas'])

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def index
    @criancas = Crianca.find(:all)

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
SELECT * FROM `grupos` WHERE (`grupos`.`id` IN (1,2,3,4))
SELECT * FROM `unidades` WHERE (`unidades`.`id` IN (9,26,39,40,28,41,2,3,32))
---
  def search
    @crianca = Crianca.find(:all, :conditions => ["nome like ?", "%" + params[:search].to_s + "%"], :include => ['grupo','unidade'])

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def show
     @crianca = Crianca.find(params[:id])

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def edit

    @crianca = Crianca.find(params[:id])

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
INSERT INTO `logs` (`obs`, `data`, `created_at`, `updated_at`, `user_id`, `crianca_id`) VALUES('Apagado', '27/07/10 13:25', '2010-07-27 16:25:38', '2010-07-27 16:25:38', 1, 540)
DELETE FROM `criancas` WHERE `id` = 540
---
  def destroy
    @crianca = Crianca.find(params[:id])
    @crianca_log = Log.new
    @crianca_log.user_id = current_user.id
    @crianca_log.obs = "Apagado"
    @crianca_log.data = (Time.now().strftime("%d/%m/%y %H:%M")).to_s
    @crianca_log.crianca_id = @crianca.id
    @crianca_log.save
    @crianca.destroy

SELECT * FROM `criancas` WHERE (grupo_id = 1 and option1 = 52 and matricula != 1) ORDER BY servidor_publico desc, transferencia desc, created_at
SELECT * FROM `criancas` ORDER BY nome ASC
---
  def classif
    $unidade = params[:unidade_unidade_class_id]
    $consulta = 4
    @crianca = Crianca.find(:all, :conditions => ["grupo_id = " + $class + " and option1 = " + $unidade + " and matricula != 1"], :order => "servidor_publico desc, transferencia desc, created_at")
    if @crianca.nil? or @crianca.empty? then

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def nome_crianca
    $consulta = 6
    $crianca = params[:crianca_crianca_id]
    @crianca = Crianca.find(:all, :conditions => ['id=' + $crianca ])

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
 def update_matricular
 @matricula = Crianca.find(params[:id])

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
UPDATE `criancas` SET `updated_at` = '2010-07-28 16:07:23', `vaga_num` = '1/30', `unidade_matricula` = 26, `matricula` = 1, `obs` = 'aw', `historico_contato` = '', `ano_letivo` = 2010, `necessidade` = '' WHERE `id` = 1309
UPDATE `vagas` SET `updated_at` = '2010-07-28 16:07:23', `vagas_preenchidas` = 1 WHERE `id` = 6
---
def matricular
 matricula = Crianca.find(params[:id])
 matricula.vaga_num = matricula.vaga_numero(params[:crianca][:unidade_matricula])
     respond_to do |format|
      if matricula.update_attributes(params[:crianca])

SELECT * FROM `grupos` WHERE (`grupos`.`id` = 4)
---
  def load_grupos
    @grupos =  Grupo.find(:all, :order => "nome")

SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 3) LIMIT 1
---
  def load_regiaos
    @regiaos =  Regiao.find(:all, :order => "nome")

SELECT * FROM `unidades` WHERE (`unidades`.`id` = 41) LIMIT 1
---
  def load_unidades
    @unidades =  Unidade.find(:all, :order => "nome")

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def load_criancas
    @criancas = Crianca.find(:all, :order => "nome ASC")

SELECT * FROM `criancas` WHERE (`criancas`.`matricula` = 1)
SELECT * FROM `matriculas` WHERE (`matriculas`.`crianca_id` = 4) LIMIT 1
---
  def load_criancas_mat
    @criancasmat = Crianca.find(:all, :conditions => ["matricula = 0" ], :order => "nome ASC")