demanda/app/controllers/matriculas_controller.rb

SELECT * FROM `matriculas` WHERE (`matriculas`.`id` = 7 AND (`matriculas`.crianca_id = 75))
---
  def show
    @matricula = @crianca.matriculas.find(params[:id])

SELECT * FROM `criancas` WHERE (`criancas`.`id` = 75)
SELECT * FROM `grupos` WHERE (`grupos`.`id` = 2)
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 1)
---
  def load_crianca
    @grupo = Grupo.find(:all, :conditions => ["id = ?",Crianca.find(params[:crianca_id]).grupo_id])
    @crianca = Crianca.find(params[:crianca_id])
    @unidade = Unidade.find(:all, :conditions => ['id = ?', Crianca.find(params[:crianca_id]).unidade_matricula])