app/controllers/criancas_controller.rb

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def index
    @criancas = Crianca.find(:all)

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def show
     @crianca = Crianca.find(params[:id])

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def edit

    @crianca = Crianca.find(params[:id])

INSERT INTO `criancas` (`endereco`, `complemento`, `option4`, `unidade_matricula`, `obs`, `created_at`, `tel1`, `responsavel`, `nome`, `regiao_id`, `tel2`, `updated_at`, `nascimento`, `unidade_id`, `nomerecado`, `necessidade`, `mae`, `grupo_id`, `parentesco`, `posicao`, `bairro`, `local_trabalho`, `servidor_publico`, `numero`, `nome_responsavel`, `fonetrabalho`, `option1`, `celular`, `trabalha`, `option2`, `status`, `transferencia`, `obs_transf`, `n_especial`, `gemelar`, `option3`, `matricula`, `mudou_endereco`) VALUES('TESTE3', 'TESTE3', 0, 0, NULL, '2010-01-27 11:13:00', '3', 1, 'TESTE3', 6, '3', '2010-01-27 11:14:30', '2010-01-27', 15, 'TESTE3', 'TESTE3', 'TESTE3', 5, 'TIA', 0, 'TESTE3', 'TESTE3', 1, '3', 'TESTE3', 'TESTE3', 37, '3', 1, 38, 0, 0, NULL, 1, 1, 0, 0, 0)
---
  def create
    @crianca = Crianca.new(params[:crianca])
  $flag_imp = 0
  $flag_btimp = 0

    respond_to do |format|
      if @crianca.save

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
UPDATE `criancas` SET `updated_at` = '2010-01-27 12:05:11', `unidade_matricula` = 38, `matricula` = 1, `obs` = 'TESTE4', `option4` = NULL, `option3` = NULL, `mudou_endereco` = 1, `transferencia` = 1, `obs_transf` = 'TESTE4TESTE4TESTE4TESTE4' WHERE `id` = 557
---
  def update
    @crianca = Crianca.find(params[:id])
    @atualiza_log = Log.new
    @atualiza_log.user_id = current_user.id
    @atualiza_log.obs = "Atualizado"
    @atualiza_log.data = (Time.now().strftime("%d/%m/%y %H:%M")).to_s
    @atualiza_log.crianca_id = @crianca.id
    @atualiza_log.save

    respond_to do |format|
      if @crianca.update_attributes(params[:crianca])

SELECT * FROM `criancas` WHERE (((id= 1667 and (option1 = 15 or option2 = 15 or option3 = 15 or option4 = 15))))
SELECT * FROM `criancas` ORDER BY nome ASC
---
  def autentica_matricula
    $unidade_matricula = params[:crianca_unidade_matricula]
    #@teste = Crianca.find(params[:id])
    @existe = Crianca.find(:all, :conditions => ["((id= "+ $id_crianca +" and (option1 = " + $unidade_matricula + " or option2 = " + $unidade_matricula + " or option3 = " + $unidade_matricula + " or option4 = " + $unidade_matricula +")))"])
    if @existe.empty? then

SELECT * FROM `criancas` WHERE (grupo_id = 1 and option1 = 1 and matricula != 1) ORDER BY servidor_publico desc, transferencia desc, created_at
SELECT * FROM `criancas` ORDER BY nome ASC
---
  def classif
    $unidade = params[:unidade_unidade_class_id]
    $consulta = 4
    @crianca = Crianca.find(:all, :conditions => ["grupo_id = " + $class + " and option1 = " + $unidade + " and matricula != 1"], :order => "servidor_publico desc, transferencia desc, created_at")
    if @crianca.nil? or @crianca.empty? then

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def atualiza_grupo
    @atualiza_grupo = Crianca.find(:all)

SELECT * FROM `criancas` WHERE (option1 = 15 and matricula != 1) ORDER BY servidor_publico desc, transferencia desc, created_at
SELECT * FROM `criancas` ORDER BY nome ASC
---
  def un_op1_din
    #@criancas = Crianca.un_din
    $consulta = 1
    $unidade_op1_id = params[:unidade_unidade_op1_id]

    @crianca = Crianca.find(:all, :conditions => ["option1 = "+ $unidade_op1_id + " and matricula != 1"], :order =>("servidor_publico desc, transferencia desc, created_at"))
    if @crianca.nil? or @crianca.empty? then

SELECT * FROM `criancas` WHERE (unidade_matricula =52 and matricula =1) ORDER BY created_at
SELECT * FROM `criancas` ORDER BY nome ASC
---
  def mat_unidade
    $consulta = 2
    $unidade = params[:unidade_unidade_mat_id]
    @crianca = Crianca.find(:all, :conditions => ["unidade_matricula =" + $unidade + " and matricula =1"], :order => "created_at")
    if @crianca.nil? or @crianca.empty? then

SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def nome_crianca
    $consulta = 6
    $crianca = params[:crianca_crianca_id]
    @crianca = Crianca.find(:all, :conditions => ['id=' + $crianca ])

SELECT * FROM `grupos` WHERE (`grupos`.`id` = '1') LIMIT 1
SELECT * FROM `unidades` ORDER BY nome
---
  def grupo_crianca
      @zero = Grupo.find_by_id(params[:crianca_grupo_id])
      @unidades = Unidade.find :all, :conditions => {:tipo => params[:crianca_grupo_id]}

SELECT * FROM `unidades` WHERE (`unidades`.`regiao_id` = '6')
SELECT count(*) AS count_all FROM `unidades` WHERE (`unidades`.`regiao_id` = '6')
---
  def rg

    @unidades = Unidade.find :all, :conditions => {:regiao_id => params[:crianca_regiao_id]}
    @u = Unidade.count :all, :conditions => {:regiao_id => params[:crianca_regiao_id]}

SELECT * FROM `criancas` WHERE (`criancas`.`nome` = 'yyyyyy') LIMIT 1
---
  def mesmo_nome
    $nome = params[:crianca_nome]
    @verifica = Crianca.find_by_nome($nome)

SELECT * FROM `criancas` WHERE (`criancas`.`mae` = 'yyyy') LIMIT 1
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
---
  def mesma_mae
     if Crianca.find_by_mae(params[:crianca_mae]) then
       if Crianca.find_by_nome($nome) then

SELECT * FROM `grupos` WHERE (`grupos`.`id` = 3) LIMIT 1
---
  def load_grupos
    @grupos =  Grupo.find(:all, :order => "nome")

SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 6) LIMIT 1
---
  def load_regiaos
    @regiaos =  Regiao.find(:all, :order => "nome")

SELECT * FROM `unidades` WHERE (`unidades`.`id` IS NULL) LIMIT 1
---
  def load_unidades
    @unidades =  Unidade.find(:all, :order => "nome")

SELECT * FROM `criancas` WHERE (matricula != 0 and unidade_matricula = 15)
---
  def load_criancas
    @criancas = Crianca.find(:all, :order => "nome ASC")

SELECT * FROM `criancas` WHERE (`criancas`.`matricula` = 1)
---
  def load_criancas_mat
    @criancasmat = Crianca.find(:all, :conditions => ["matricula = 0" ], :order => "nome ASC")