app/controllers/logs_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def load_users
    @users = User.find(:all)

SELECT * FROM `logs` WHERE (user_id = 2)
---
  def log_user
    $log_user = params[:log_user_id]
    @log_user = Log.find(:all,:conditions => 'user_id = ' + $log_user)