app/controllers/roles_users_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`id` = 2)
SELECT * FROM `roles_users` WHERE (`roles_users`.`id` = 2)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def load_role
    @roles = Role.find(:all)
    @role_users = RolesUser.find(:all)

INSERT INTO `roles_users` (`role_id`, `user_id`) VALUES(2, 2)
---
  def create
    @role_user = RolesUser.new(params[:roles_user])
    respond_to do |format|
      if @role_user.save

UPDATE `roles_users` SET `role_id` = 3 WHERE `id` = 2
---
  def update
    @role_user = RolesUser.find(params[:id])
    @role_user.role_id = $new_role_id
    respond_to do |format|
      if @role_user.update_attributes(params[:role_user])