app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('41f9b2cc116cf21c1e003ca7feb5af46e73241aa', '2010-01-28 10:02:37', NULL, 'c87d8237862465979aa94d84c48f706ec980e43b', NULL, '2010-01-28 10:02:37', '532cbeea69eb1e0aa285063a52455f024b614424', NULL, 'teste', NULL)
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save