app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('da7468e76a36eb5e807260220d196fee8dbdd127', '2010-06-21 16:54:13', NULL, 'f103c695baf7050a5f5178545be32d2d72292c1a', NULL, '2010-06-21 16:54:13', 'dfb1b60191e01dc22c2f5bf306d24508a786017d', NULL, 'naor', 'naorgarciaf@hotmail.com')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save